Revit 2026 API

# CustomInitialColor(CustomInitialColor) Constructor

---

Creates a copy of the given custom initial color

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CustomInitialColor(
	CustomInitialColor other
)
```
```vb
Public Sub New (
	other As CustomInitialColor
)
```
```cpp
public:
CustomInitialColor(
	CustomInitialColor^ other
)
```
```fsharp
new :
        other : CustomInitialColor -> CustomInitialColor
```

#### Parameters

other CustomInitialColor

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

CustomInitialColor Class

CustomInitialColor Overload

Autodesk.Revit.DB.Lighting Namespace